<?php
//Lesson 5. Task 60
//Заполнение массивов
//1
$arr=[];
$arr[]=1;
$arr[]=2;
$arr[]=3;
$arr[]=4;
$arr[]=5;
$arr[]=6;
$arr[]=7;
$arr[]=8;
$arr[]=9;
$arr[]=10;

//2
$arr=[];
$arr[]="x";
$arr[]="x";
$arr[]="x";
$arr[]="x";
$arr[]="x";
var_dump($arr);

//3
/*
 * С помощью цикла заполните массив числами от 1 до 100.
 */
$arr=[];
for ($i=0;$i<=100;$i++)
    $arr[]=$i+1;
var_dump($arr);

//4
/*
 * С помощью цикла заполните массив нечетными числами в промежутке от 1 до 99.
 */
$arr=[];
for ($i=1;$i<=99;$i++) {
    if ($i%2===0) {
        $arr[]=$i+1;
    }
}
var_dump($arr);
?>



