// <meta charset="utf-8">
//Вывод русского  текста корректно
<?php

//Lesson 3. Task 21
// Формулы
//1
$r=5;
$s=M_PI*$r**2;
echo $s; // Площадь круга
//2
$a=4;
$s=$a**2;
echo $s; // площадь квадрата
//3
$a=3;
$b=4;
$s=$a*$b; // Площадь прямоугольника
echo $s;
//4
$a=3;
$b=4;
$p=($a+$b)*2;
echo $p; // периметр прямоугольника
//5
$tc=3;// Гадусы цельсия
$f=9/5*$tc+32;
echo $f; //вывод градусов в фарингейтах
//6
$tf=50; //Градусы фаренгейта
$tc=5/9*($tf-32);
echo $tc; // вывод фаренгейтов в градусах
?>


